<template>
	<view class="box">
		<view class="item" v-for="(item, index) in list" v-bind:key="index">
			<view class="quest" @tap="onOpen(index)">
				{{item.q}}
			</view>
			<view class="answer" v-show="cur==index">
				{{item.a}}
			</view>
		</view>
	</view>
</template>

<script>
	
	let listData = [{"q":"申请人需要具备什么条件？","a":"答：\n\t\t\t\t\t\t\t年满18周岁的年轻人，均可以进行办理。感谢您对悠乐贷的关注。"},{"q":"为什么我有额度，不能借款？","a":"答：\n\t\t\t\t\t\t\t\tAPP显示的额度是您可以使用的最大额度，但是提交申请之后是需要经过审核的，是否通过以审核结果为准。感谢您对悠乐贷的关注。"},{"q":"我能申请多少金额？分多少期？","a":"答：\n\t\t\t\t\t\t\t\t悠乐贷是服务于年轻人的短期信用借款。最少可申请5000元，我们根据大数据为用户个性化匹配最高可申请金额，其中上班族最高可申请500000元，尚未在职的年轻人最高可申请500000元。给你花支持多种分期期数，满足不同借款需求，您可以根据自己的需求调整申请金额和分期期数。感谢您对悠乐贷的关注。"},{"q":"订单提交后可以修改吗？怎么取消订单？","a":"答：\n\t\t\t\t\t\t\t\t申请金额、分期期数等订单信息一经提交无法修改，请您确认订单并核实无误后进行下单。在申请结果出具之前，如需取消订单，请您联系在线客服取消。感谢您对悠乐贷的关注。"},{"q":"芝麻信用认证时，提示支付宝账号不存在？","a":"答：\n\t\t\t\t\t\t\t\t当您填写的姓名、身份证号跟您支付宝绑定的姓名、身份证号不一致时，会出现该提示，请您确保您的姓名身份证号与支付宝保持一致。感谢您对悠乐贷的关注。"},{"q":"为什么没有接到审核电话？","a":"答：订单审核时间一般为6-48小时，如遇节假日或申请人数过多，审核进度可能会有延迟。请您保持手机畅通，以便审核人员联系您。您也可以登录好享贷APP，进入“我的借款”查看审核进度。感谢您对悠乐贷的关注。"},{"q":"为什么订单审核失败？","a":"答：若您填写的个人资料不完整不真实、上传的照片模糊、有遮挡、综合评分不足等，均会导致失败。感谢您对悠乐贷的关注。"},{"q":"为什么会审核失败？综合信用评分不足？","a":"答：若您填写的个人资料不完整不真实、上传的照片模糊、有遮挡等均会导致审核失败。"},{"q":"审核时间有多久？怎么加快审核进度？","a":"答：订单审核时间一般为6-48小时，如遇节假日或申请人数过多，审核进度可能会有延迟。请您保持手机畅通，以便审核人员联系您。您也可以登录好享贷APP，进入“我的借款”查看审核进度。"},{"q":"订单审核通过后，款项什么时候到账？","a":"答：\n\t\t\t\t\t\t\t订单审核通过后，预计工作日内最快2个小时打款到您绑定的银行卡中。届时会以短信形式通知您，请注意查收。感谢您对悠乐贷的关注。"},{"q":"支持哪几家银行卡服务？","a":"答：\n\t\t\t\t\t\t\t\t悠乐贷目前支持以下银行的储蓄卡：中国银行、农业银行、工商银行、建设银行、邮储银行、招商银行、民生银行、光大银行、兴业银行、中信银行、平安银行、浦发银行、华夏银行、广发银行。感谢您对悠乐贷的关注。"},{"q":"绑定银行卡为什么会失败？","a":"答：\n\t\t\t\t\t\t\t\t请您确认绑定的银行卡为申请人本人所有，且银行卡的相关信息确认无误。若银行卡信息有误，请您联系相关银行进行核实。感谢您对悠乐贷的关注。"},{"q":"我怎么进行还款？","a":"答：悠乐贷将会在您的还款日自动从您绑定的银行卡中扣款，请您保证银行卡内余额充足、避免出现银行卡挂失、账户冻结、余额不足的情况。您也可以在每月的还款日前，登录悠乐贷APP，进入“个人中心-我的还款”，主动进行还款。"},{"q":"没有及时还款会怎样？","a":"答：若您发生逾期，从逾期首日起会按照合同收取当期应还款项的1%滞纳金作为处罚。同时，您的逾期记录将进入个人征信机构，影响您日后的个人信用记录。请您及时按期还款，感谢您对悠乐贷的关注。"},{"q":"能提前还款么？","a":"答：支持提前还款，请您登录悠乐贷APP，进入“个人中心-我的还款”进行还款。感谢您对给悠乐贷关注。"}];

	export default {
		data() {
			return {
				cur: -1,
				list: listData
			}
		},
		methods: {
			onOpen(n){
				this.cur = n;
			}
		},
		onLoad(options){
			this.cur = options.index;
			console.log(options);
		}
	}
</script>

<style lang="less" scoped>
	@import url("./answers.less");
</style>
